analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/max32662.h
/**
 * @file    max32662.h
 * @brief   Device-specific perhiperal header file
 */

/******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 *
 * Copyright (C) 2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32662_INCLUDE_MAX32662_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32662_INCLUDE_MAX32662_H_

#ifndef TARGET_NUM
#define TARGET_NUM 32662
#endif

#include <stdint.h>

#ifndef FALSE
#define FALSE (0)
#endif

#ifndef TRUE
#define TRUE (1)
#endif

#if !defined(__GNUC__)
#define CMSIS_VECTAB_VIRTUAL
#define CMSIS_VECTAB_VIRTUAL_HEADER_FILE "nvic_table.h"
#endif /* !__GNUC__ */

/* COMPILER SPECIFIC DEFINES (IAR, ARMCC and GNUC) */
#if defined(__GNUC__) /* GCC */
#ifndef __weak
#define __weak __attribute__((weak))
#endif

#elif defined(__CC_ARM) /* Keil */

#define inline __inline
#pragma anon_unions

#endif

typedef enum {
    NonMaskableInt_IRQn = -14,
    HardFault_IRQn = -13,
    MemoryManagement_IRQn = -12,
    BusFault_IRQn = -11,
    UsageFault_IRQn = -10,
    SVCall_IRQn = -5,
    DebugMonitor_IRQn = -4,
    PendSV_IRQn = -2,
    SysTick_IRQn = -1,

    /* Device-specific interrupt sources (external to ARM core)                 */
    /*                      table entry number                                  */
    /*                      ||||                                                */
    /*                      ||||  table offset address                          */
    /*                      vvvv  vvvvvv                                        */

    PF_IRQn = 0, /* 0x10  0x0040  16: Power Fail */
    WDT_IRQn, /* 0x11  0x0044  17: Watchdog */
    RSV2_IRQn, /* 0x12  0x0048  18: Reserved */
    RTC_IRQn, /* 0x13  0x004C  19: RTC */
    TRNG_IRQn, /* 0x14  0x0050  20: TRNG */
    TMR0_IRQn, /* 0x15  0x0054  21: Timer 0 */
    TMR1_IRQn, /* 0x16  0x0058  22: Timer 1 */
    TMR2_IRQn, /* 0x17  0x005C  23: Timer 2 */
    TMR3_IRQn, /* 0x18  0x0060  24: Timer 3 */
    RSV9_IRQn, /* 0x19  0x0064  25: Reserved */
    RSV10_IRQn, /* 0x1A  0x0068  26: Reserved */
    RSV11_IRQn, /* 0x1B  0x006C  27: Reserved */
    RSV12_IRQn, /* 0x1C  0x0070  28: Reserved */
    I2C0_IRQn, /* 0x1D  0x0074  29: I2C0 */
    UART0_IRQn, /* 0x1E  0x0078  30: UART 0 */
    UART1_IRQn, /* 0x1F  0x007C  31: UART 1 */
    SPI0_IRQn, /* 0x20  0x0080  32: SPI0 */
    SPI1_IRQn, /* 0x21  0x0084  33: SPI1 */
    RSV18_IRQn, /* 0x22  0x0088  34: Reserved */
    RSV19_IRQn, /* 0x23  0x008C  35: Reserved */
    ADC_IRQn, /* 0x24  0x0090  36: ADC */
    RSV21_IRQn, /* 0x25  0x0094  37: Reserved */
    RSV22_IRQn, /* 0x26  0x0098  38: Reserved */
    FLC_IRQn, /* 0x27  0x009C  39: Flash Controller */
    GPIO0_IRQn, /* 0x28  0x00A0  40: GPIO0 */
    RSV25_IRQn, /* 0x29  0x00A4  41: Reserved */
    RSV26_IRQn, /* 0x2A  0x00A8  42: Reserved */
    RSV27_IRQn, /* 0x2B  0x00AC  43: Reserved */
    DMA0_IRQn, /* 0x2C  0x00B0  44: DMA0 */
    DMA1_IRQn, /* 0x2D  0x00B4  45: DMA1 */
    DMA2_IRQn, /* 0x2E  0x00B8  46: DMA2 */
    DMA3_IRQn, /* 0x2F  0x00BC  47: DMA3 */
    RSV32_IRQn, /* 0x30  0x00C0  48: Reserved */
    RSV33_IRQn, /* 0x31  0x00C4  49: Reserved */
    RSV34_IRQn, /* 0x32  0x00C8  50: Reserved */
    RSV35_IRQn, /* 0x33  0x00CC  51: Reserved */
    I2C1_IRQn, /* 0x34  0x00D0  52: I2C1 */
    RSV37_IRQn, /* 0x35  0x00D4  53: Reserved */
    RSV38_IRQn, /* 0x36  0x00D8  54: Reserved */
    RSV39_IRQn, /* 0x37  0x00DC  55: Reserved */
    RSV40_IRQn, /* 0x38  0x00E0  56: Reserved */
    RSV41_IRQn, /* 0x39  0x00E4  57: Reserved */
    RSV42_IRQn, /* 0x3A  0x00E8  58: Reserved */
    RSV43_IRQn, /* 0x3B  0x00EC  59: Reserved */
    RSV44_IRQn, /* 0x3C  0x00F0  60: Reserved */
    RSV45_IRQn, /* 0x3D  0x00F4  61: Reserved */
    RSV46_IRQn, /* 0x3E  0x00F8  62: Reserved */
    RSV47_IRQn, /* 0x3F  0x00FC  63: Reserved */
    RSV48_IRQn, /* 0x40  0x0100  64: Reserved */
    RSV49_IRQn, /* 0x41  0x0104  65: Reserved */
    RSV50_IRQn, /* 0x42  0x0108  66: Reserved */
    RSV51_IRQn, /* 0x43  0x010C  67: Reserved */
    RSV52_IRQn, /* 0x44  0x0110  68: Reserved */
    RSV53_IRQn, /* 0x45  0x0114  69: Reserved */
    GPIOWAKE_IRQn, /* 0x46  0x0118  70: GPIO Wakeup */
    RSV55_IRQn, /* 0x47  0x011C  71: Reserved */
    RSV56_IRQn, /* 0x48  0x0120  72: Reserved */
    RSV57_IRQn, /* 0x49  0x0124  73: Reserved */
    RSV58_IRQn, /* 0x4A  0x0128  74: Reserved */
    PT_IRQn, /* 0x4B  0x012C  75: Pulse Train */
    RSV60_IRQn, /* 0x4C  0x0130  76: Reserved */
    RSV61_IRQn, /* 0x4D  0x0134  77: Reserved */
    RSV62_IRQn, /* 0x4E  0x0138  78: Reserved */
    RSV63_IRQn, /* 0x4F  0x013C  79: Reserved */
    RSV64_IRQn, /* 0x50  0x0140  80: Reserved */
    RSV65_IRQn, /* 0x51  0x0144  81: Reserved */
    RSV66_IRQn, /* 0x52  0x0148  82: Reserved */
    RSV67_IRQn, /* 0x53  0x014C  83: Reserved */
    RSV68_IRQn, /* 0x54  0x0150  84: Reserved */
    RSV69_IRQn, /* 0x55  0x0154  85: Reserved */
    RSV70_IRQn, /* 0x56  0x0158  86: Reserved */
    RSV71_IRQn, /* 0x57  0x015C  87: Reserved */
    RSV72_IRQn, /* 0x58  0x0160  88: Reserved */
    RSV73_IRQn, /* 0x59  0x0164  89: Reserved */
    RSV74_IRQn, /* 0x5A  0x0168  90: Reserved */
    RSV75_IRQn, /* 0x5B  0x016C  91: Reserved */
    RSV76_IRQn, /* 0x5C  0x0170  92: Reserved */
    RSV77_IRQn, /* 0x5D  0x0174  93: Reserved */
    RSV78_IRQn, /* 0x5E  0x0178  94: Reserved */
    RSV79_IRQn, /* 0x5F  0x017C  95: Reserved */
    RSV80_IRQn, /* 0x60  0x0180  96: Reserved */
    RSV81_IRQn, /* 0x61  0x0184  97: Reserved */
    ECC_IRQn, /* 0x62  0x0188  98: Reserved */
    RSV83_IRQn, /* 0x63  0x018C  99: Reserved */
    RSV84_IRQn, /* 0x64  0x0190  100: Reserved */
    RSV85_IRQn, /* 0x65  0x0194  101: Reserved */
    RSV86_IRQn, /* 0x66  0x0198  102: Reserved */
    RSV87_IRQn, /* 0x67  0x019C  103: Reserved */
    RSV88_IRQn, /* 0x68  0x01A0  104: Reserved */
    RSV89_IRQn, /* 0x69  0x01A4  105: Reserved */
    RSV90_IRQn, /* 0x6A  0x01A8  106: Reserved */
    RSV91_IRQn, /* 0x6B  0x01AC  107: Reserved */
    RSV92_IRQn, /* 0x6C  0x01B0  108: Reserved */
    RSV93_IRQn, /* 0x6D  0x01B4  109: Reserved */
    RSV94_IRQn, /* 0x6E  0x01B8  110: Reserved */
    RSV95_IRQn, /* 0x6F  0x01BC  111: Reserved */
    RSV96_IRQn, /* 0x70  0x01C0  112: Reserved */
    AES_IRQn, /* 0x71  0x01C4  113: AES */
    RSV98_IRQn, /* 0x72  0x01C8  114: Reserved */
    I2S_IRQn, /* 0x73  0x01CC  115: I2S */
    RSV100_IRQn, /* 0x74  0x01D0  116: Reserved */
    RSV101_IRQn, /* 0x75  0x01D4  117: Reserved */
    RSV102_IRQn, /* 0x76  0x01D8  118: Reserved */
    RSV103_IRQn, /* 0x77  0x01DC  119: Reserved */
    RSV104_IRQn, /* 0x78  0x01E0  120: Reserved */
    RSV105_IRQn, /* 0x79  0x01E4  121: Reserved */
    RSV106_IRQn, /* 0x7A  0x01E8  122: Reserved */
    CAN_IRQn, /* 0x7B  0x01EC  123: CAN */
    MXC_IRQ_EXT_COUNT,
} IRQn_Type;

